<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"bc2eb286faa22c8cc3fa1be7ce1d14685298d2afbd1d9c3d555bfeb6013c9685","plan_job_ref":"Job Create MPE Management terraform plan #90 at https://github.com/AFMPE/mpe_management/actions/runs/4871551865","plan_hash":"6282d8c609014a8dd1b8a2d2d9d96a38dd26e5047cf16934a4c3eb4ceee78e04","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __src__
With backend config: `storage_account_name=afmpetfmgtprodh8dc4qua
container_name=core-mgt-prod-tfstate            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `src/tfvars/production/parameters.prod.tfvars
`<details open><summary>With variables</summary>

```hcl
state_sa_container_name           = (sensitive value)
state_sa_name                     = (sensitive value)
state_sa_rg                       = (sensitive value)
subscription_id_hub               = (sensitive value)
subscription_id_internal          = (sensitive value)
subscription_id_partners_gsa_dev  = (sensitive value)
subscription_id_partners_gsa_prod = (sensitive value)
subscription_id_sandbox           = (sensitive value)
```
</details>
<details>
<summary>Plan: 3 to add, 6 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.mod_sentinel_rule_alerts.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_data_connector_microsoft_threat_intelligence.dataMTI must be replaced
-/+ resource "azurerm_sentinel_data_connector_microsoft_threat_intelligence" "dataMTI" {
      + bing_safety_phishing_url_lookback_date       = "1970-01-01T00:00:00Z" # forces replacement
      ~ id                                           = "*************************************************************************************************************************************************************************************************************************************************************" -> (known after apply)
        name                                         = "MSTI_Connector"
      ~ tenant_id                                    = "************************************" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.landing_zone.module.mod_hub_network.azurerm_firewall_policy_rule_collection_group.app_rule_collection_group will be updated in-place
  ~ resource "azurerm_firewall_policy_rule_collection_group" "app_rule_collection_group" {
        id                 = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-hub-core-prod-rg/providers/Microsoft.Network/firewallPolicies/ampe-eus-hub-core-prod-afwp/ruleCollectionGroups/ampe-eus-hub-core-prod-afwp-default-arcg"
        name               = "ampe-eus-hub-core-prod-afwp-default-arcg"
        # (2 unchanged attributes hidden)

      + application_rule_collection {
          + action   = "Allow"
          + name     = "AppServiceEnvironment"
          + priority = 500

          + rule {
              + destination_fqdns = [
                  + "AppServiceEnvironment",
                  + "WindowsUpdate",
                ]
              + name              = "AppServiceEnvironment"
              + source_addresses  = [
                  + "*",
                ]

              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.landing_zone.module.mod_hub_network.azurerm_firewall_policy_rule_collection_group.nw_rule_collection_group will be updated in-place
  ~ resource "azurerm_firewall_policy_rule_collection_group" "nw_rule_collection_group" {
        id                 = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-hub-core-prod-rg/providers/Microsoft.Network/firewallPolicies/ampe-eus-hub-core-prod-afwp/ruleCollectionGroups/ampe-eus-hub-core-prod-afwp-default-nwrcg"
        name               = "ampe-eus-hub-core-prod-afwp-default-nwrcg"
        # (2 unchanged attributes hidden)

      ~ network_rule_collection {
          ~ name     = "AllowTrafficBetweenSpokes" -> "AppServiceEnvironment"
          ~ priority = 200 -> 300
            # (1 unchanged attribute hidden)

          ~ rule {
              ~ destination_ports     = [
                  - "*",
                  + "123",
                ]
              ~ name                  = "AllSpokeTraffic" -> "NTP"
              ~ source_addresses      = [
                  - "10.0.96.0/19",
                  + "*",
                ]
                # (5 unchanged attributes hidden)
            }
        }
      + network_rule_collection {
          + action   = "Allow"
          + name     = "AzureMonitor"
          + priority = 500

          + rule {
              + destination_addresses = [
                  + "AzureMonitor",
                ]
              + destination_ports     = [
                  + "80",
                  + "443",
                  + "12000",
                ]
              + name                  = "AzureMonitor"
              + protocols             = [
                  + "TCP",
                ]
              + source_addresses      = [
                  + "*",
                ]
            }
        }
      + network_rule_collection {
          + action   = "Allow"
          + name     = "AllowTrafficBetweenSpokes"
          + priority = 200

          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "*",
                ]
              + name                  = "AllSpokeTraffic"
              + protocols             = [
                  + "Any",
                ]
              + source_addresses      = [
                  + "10.0.96.0/19",
                ]
            }
        }

        # (1 unchanged block hidden)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["StorageAccounts"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/StorageAccounts"
      - subplan       = "PerTransaction" -> null
        # (2 unchanged attributes hidden)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["VirtualMachines"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/VirtualMachines"
      - subplan       = "P2" -> null
        # (2 unchanged attributes hidden)
    }

  # module.landing_zone.module.mod_ops_network.azurerm_virtual_network_peering.spoke_to_hub will be updated in-place
  ~ resource "azurerm_virtual_network_peering" "spoke_to_hub" {
      ~ allow_virtual_network_access = false -> true
        id                           = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-ops-core-prod-rg/providers/Microsoft.Network/virtualNetworks/ampe-eus-ops-core-prod-vnet/virtualNetworkPeerings/peering-ampe-eus-ops-core-prod-vnet-to-ampe-eus-hub-core-prod-vnet"
        name                         = "peering-ampe-eus-ops-core-prod-vnet-to-ampe-eus-hub-core-prod-vnet"
        # (6 unchanged attributes hidden)
    }

  # module.landing_zone.module.mod_svcs_network.azurerm_subnet_route_table_association.rtaddassoc["pe-snet"] will be created
  + resource "azurerm_subnet_route_table_association" "rtaddassoc" {
      + id             = (known after apply)
      + route_table_id = "*******************************************************************************************************************************************************************"
      + subnet_id      = "**************************************************************************************************************************************************************************************************"
    }

  # module.landing_zone.module.mod_svcs_network.azurerm_virtual_network_peering.spoke_to_hub will be updated in-place
  ~ resource "azurerm_virtual_network_peering" "spoke_to_hub" {
      ~ allow_virtual_network_access = false -> true
        id                           = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-svcs-core-prod-rg/providers/Microsoft.Network/virtualNetworks/ampe-eus-svcs-core-prod-vnet/virtualNetworkPeerings/peering-ampe-eus-svcs-core-prod-vnet-to-ampe-eus-hub-core-prod-vnet"
        name                         = "peering-ampe-eus-svcs-core-prod-vnet-to-ampe-eus-hub-core-prod-vnet"
        # (6 unchanged attributes hidden)
    }

  # module.mod_management_groups_budgets[0].module.mod_mpe_mg_budgets.azurerm_consumption_budget_management_group.mg_budget must be replaced
-/+ resource "azurerm_consumption_budget_management_group" "mg_budget" {
      ~ etag                = "\"1d973a993d0c38d\"" -> (known after apply)
      ~ id                  = "***********************************************************************************************************************" -> (known after apply)
        name                = "MPE Workloads Budget"
        # (3 unchanged attributes hidden)

      - notification { # forces replacement
          - contact_emails = [
              - "ampe@missionpartners.us",
            ] -> null
          - enabled        = true -> null
          - operator       = "GreaterThan" -> null
          - threshold      = 90 -> null
          - threshold_type = "Actual" -> null
        }
      + notification { # forces replacement
          + contact_emails = [
              + "afmpe_admins@missionpartners.us",
            ]
          + enabled        = true
          + operator       = "GreaterThan"
          + threshold      = 90
          + threshold_type = "Actual"
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 6 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Create MPE Management terraform plan #90](https://github.com/AFMPE/mpe_management/actions/runs/4871551865)